packages/fastpay/fastpay-1.0.0.tar.gz/fastpay-1.0.0/tests/mock/charge_list.txt

{
    "data": [
        {
            "refunds": [],
                "captured": true,
                "card": {
                    "fingerprint": "022e2184e3b910cd0d96b89d4ba1d9e3a97139b7",
                    "exp_year": 2019,
                    "exp_month": 11,
                    "type": "Visa",
                    "last4": "4242",
                    "object": "card",
                    "id": "card_xbeO4u8xz8Kyn4njOajjlQJ0"
                },
                "failure_message": "0",
                "refunded": false,
                "paid": true,
                "id": "ch_Cfam8ouZ6UW9ElHAP3SCoyZf",
                "object": "charge",
                "livemode": false,
                "currency": "jpy",
                "description": null,
                "amount": "400",
                "amount_refunded": null,
                "created": 1392339207
        },
        {
            "refunds": [],
            "captured": true,
            "card": {
                "fingerprint": "022e2184e3b910cd0d96b89d4ba1d9e3a97139b9",
                "exp_year": 2017,
                "exp_month": 9,
                "type": "Visa",
                "last4": "9999",
                "object": "card",
                "id": "card_xbeO4u8xz8Kyn4njOajjlQJ7"
            },
            "failure_message": "0",
            "refunded": false,
            "paid": true,
            "id": "ch_Cfam9ouZ6UW9ElHAP3SCoyZf",
            "object": "charge",
            "livemode": false,
            "currency": "jpy",
            "description": null,
            "amount": "400",
            "amount_refunded": null,
            "created": 1392339207
        },
        {
            "refunds": [],
            "captured": true,
            "card": {
                "fingerprint": "022e2184e3b910cd0d96b89d4ba1d9e3a97139b9",
                "exp_year": 2017,
                "exp_month": 9,
                "type": "Visa",
                "last4": "9999",
                "object": "card",
                "id": "card_xbeO4u8xz8Kyn4njOajjlQJ7"
            },
            "failure_message": "0",
            "refunded": false,
            "paid": true,
            "id": "ch_Cfmb9ou9El6ZUWHAP3SCoyZf",
            "object": "charge",
            "livemode": false,
            "currency": "jpy",
            "description": null,
            "amount": "400",
            "amount_refunded": null,
            "created": 1392339207
        }
    ],
    "count": 3,
    "url": "/v1/charges",
    "object": "list"
}
