packages/fastpay/fastpay-1.0.0.tar.gz/fastpay-1.0.0/tests/mock/charge_partial_refund_all.txt

{
    "refunds": [
        {
            "object": "refund",
            "created": 1392337942,
            "currency": "jpy",
            "amount": "100"
        },
        {
            "object": "refund",
            "created": 1392337952,
            "currency": "jpy",
            "amount": "100"
        },
        {
            "object": "refund",
            "created": 1392337972,
            "currency": "jpy",
            "amount": "200"
        }
    ],
    "captured": false,
    "card": {
        "fingerprint": "022e2184e3b910cd0d96b89d4ba1d9e3a97139b7",
        "exp_year": 2019,
        "exp_month": 11,
        "type": "Visa",
        "last4": "4242",
        "object": "card",
        "id": "card_j0wc4FRFX2jYbMOT1SmMCk0c"
    },
    "failure_message": null,
    "refunded": true,
    "paid": true,
    "id": "ch_99a0699911fda5cb68ee1bbd3815300d8149f691",
    "object": "charge",
    "livemode": false,
    "currency": "jpy",
    "description": null,
    "amount": 400,
    "amount_refunded": 400,
    "created": 1392337942
}
